{
  "lm": null,
  "traces": [],
  "train": [],
  "demos": [
    {
      "augmented": true,
      "text": "Determine if the following sentence is about adverse drug reactions: A patient with acute changes suggesting acute hepatitis after parenteral amiodarone administration is described.",
      "label": 1
    },
    {
      "augmented": true,
      "text": "Determine if the following sentence is about adverse drug reactions: The treatment was given on an outpatient basis without requiring prolonged patient sedation or immobilization.",
      "label": 0
    },
    {
      "augmented": true,
      "text": "Determine if the following sentence is about adverse drug reactions: The progressive regression was remarkable.",
      "label": 0
    },
    {
      "augmented": true,
      "text": "Determine if the following sentence is about adverse drug reactions: Development of nephrotic syndrome in a patient with acute myeloblastic leukemia after treatment with macrophage-colony-stimulating factor.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Insulin-induced lipoatrophy in type I diabetes.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: We concluded that the recurrent bacteraemia in this predisposed patient was due to re-infection, and that antibiotic treatment (amoxicillin plus an aminoglycoside) resulted in a complete eradication of the infective microorganism.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: OBJECTIVE: To report a case of marked elevation of serum creatine kinase (CK) associated with olanzapine therapy.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: The infant was given indomethacin to induce constriction of sPDA.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Even though anti-inflammatory, analgesic and antipyretic effects of henna have been shown, it may cause severe side-effects in some cases.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Seizures occurred in two patients with probable Alzheimer's disease who were receiving long-term treatment with metrifonate, an irreversible acetylcholinesterase inhibitor.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Because the shortage of MVI is expected to be a long-term, there are likely to be more cases of WE in the pediatric population of TPN-dependent children.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: A 32-year-old man with a family history of type 2 diabetes mellitus presented with circulatory collapse and deep coma after 9 days of treatment with perospirone hydrochloride, a recently developed atypical antipsychotic agent available only in Japan.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Priapism associated with trazodone therapy: case report.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: L-asparaginase-induced severe necrotizing pancreatitis successfully treated with percutaneous drainage.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Lithium for irritability in post-traumatic stress disorder.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: The case reported here illustrates that clinicians should be aware of this potentially fatal drug reaction.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Epidural spinal lipomatosis with acute onset of paraplegia in an HIV-positive patient treated with corticosteroids and protease inhibitor: case report.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Of the 16 patients, including the 1 reported here, only 3 displayed significant shortening of the agranulocytic period after treatment.",
      "label": 0
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Camptocormia, a new side effect of sodium valproate.",
      "label": 1
    },
    {
      "text": "Determine if the following sentence is about adverse drug reactions: Although adverse sequelae to these episodes of hypertension were not noticed, this report documents the uptake of phenylephrine from topical ocular application and suggests the need for dose-response measurements for this adjunct to mydriatic treatment in dogs.",
      "label": 0
    }
  ],
  "signature": {
    "instructions": "Use a language model to predict the label (1 for adverse drug reactions, 0 otherwise) for a given medical sentence by identifying relevant keywords or phrases associated with adverse drug reactions.",
    "fields": [
      {
        "prefix": "Text:",
        "description": "${text}"
      },
      {
        "prefix": "Label:",
        "description": "${label}"
      }
    ]
  }
}